/*
4.	珍珠奶茶與烏龍拿鐵分別為45與55元, 請先詢問客人各需要買幾瓶, 當珍珠奶茶與烏龍拿鐵購買總數超過15瓶, 並且總額達(含) 800元, 售價享有9折優惠：
*/

#include<stdio.h>
#include<stdlib.h>
int main(void)
{
	int B,O,T; //T可以用 ((B*45+55*O)*0.9) 和%.1f 去替換 
	printf("珍珠奶茶與烏龍拿鐵分別為45與55元, 請問各需要買幾瓶, \n當珍珠奶茶與烏龍拿鐵購買總數超過15瓶, 並且總額達(含) 800元, 售價享有9折優惠:\n");
	printf("珍珠奶茶45元:");
	scanf("%d",&B);
	printf("烏龍拿鐵55元:");
	scanf("%d",&O);
	//T=((B*45+55*O)*0.9);
	if((B*45+55*O)>=800 && (B+O>=15)){
		printf("因為總額達(含)800元，且總瓶數大於15瓶，您享有九折優惠 金額為%.1f\n",((B*45+55*O)*0.9));//加總需另創變數 
	}else{
		printf("您未達九折優惠門檻，金額為%d\n",(B*45+55*O));
	}
	system("pause");
	return 0;
}

